package com.dev.rexhuang.zhiliao_core.entity;

/**
 * *  created by RexHuang
 * *  on 2019/9/16
 */
public class LyricEntity {

    /**
     * code : 0
     * data : [00:28.050]我的青春 也不是没伤痕
     [00:33.950]是明白爱是信仰的延伸
     [00:40.020]什么特征 人缘还是眼神
     [00:44.460]也不会预知爱不爱的可能
     [00:52.510]保持单身 忍不住又沉沦
     [00:58.090]兜着圈子来去有时苦等
     [01:04.590]人的一生 感情是旋转门
     [01:09.210]转到了最后真心的就不分
     [01:15.290]有过竞争 有过牺牲
     [01:19.620]被爱筛选过程
     [01:22.270]学会认真 学会忠诚
     [01:25.590]适者才能生存
     [01:28.130]懂得永恒 得要我们
     [01:35.100]进化成更好的人
     [01:53.180]我的青春 有时还蛮单纯
     [01:59.120]相信幸福取决于爱得深
     [02:05.500]读进化论 我赞成达尔文
     [02:09.800]没实力的就有淘汰的可能
     [02:16.290]我的替身 已换过多少轮
     [02:24.000]记忆在旧情人心中变冷
     [02:30.310]我的一生 有几道旋转门
     [02:34.890]转到了最后只剩你我没分
     [02:42.250]有过竞争 有过牺牲
     [02:45.400]被爱筛选过程
     [02:48.100]学会认真 学会忠诚
     [02:51.370]适者才能生存
     [02:54.150]懂得永恒 得要我们
     [03:00.330]进化成更好的人
     [03:07.820]有过竞争 有过牺牲
     [03:11.300]被爱筛选过程
     [03:13.670]学会认真 学会忠诚
     [03:16.950]适者才能生存
     [03:19.530]懂得永恒 得要我们
     [03:27.280]进化成更好的人
     [03:35.230]懂得永恒 得要我们
     [03:43.160]进化成更好的人
     */

    private int code;
    private String data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getData() {
        return data;
    }

    public void setData(String data) {
        this.data = data;
    }
}
